# coding:UTF-8

atom = {'H':1.00794,'He':4.002602,'Li':6.941,'Be':9.0112831,'B':10.811,'C':12.0107,'N':14.0067,'O':15.9994,'F':18.998403163,'Ne':20.1797,'Na':22.98976928,'Mg':24.3050,'Al':26.9815385,'Si':28.0855,'P':30.973761998,'S':32.065,'Cl':35.453,'Ar':39.948,'K':39.0983,'Ca':40.078,'Sc':44.955908,'Ti':47.867,'V':50.9415,'Cr':51.9961,'Mn':54.938044,'Fe':55.845,'Co':58.933194,'Ni':58.6934,'Cu':63.546,'Zn':65.38,'Ga':69.723,'Ge':72.64,'As':74.921595,'Se':78.971,'Br':79.904,'Kr':83.798,'Rb':85.4678,'Sr':87.62,'Y':88.90584,'Zr':91.224,'Nb':92.90637,'Mo':95.95,'Tc':98.9072,'Ru':101.07,'Rh':102.90550,'Pd':106.42,'Ag':107.8682,'Cd':112.414,'In':114.818,'Sn':118.710,'Sb':121.760,'Te':127.60,'I':126.90447,'Xe':131.293,'Cs':132.90545196,'Ba':137.327,'La':138.90547,'Ce':140.116,'Pr':140.90766,'Nd':144.242,'Pm':144.9,'Sm':150.36,'Eu':151.964,'Gd':157.25,'Tb':158.92535,'Dy':162.500,'Ho':164.93033,'Er':167.259,'Tm':168.93422,'Yb':173.054,'Lu':174.9668,'Hf':178.49,'Ta':180.94788,'W':183.84,'Re':186.207,'Os':190.23,'Ir':192.217,'Pt':195.084,'Au':196.966569,'Hg':200.59,'Tl':204.3833,'Pb':207.2,'Bi':208.98040,'Po':208.9824,'At':209.9871,'Rn':222.0176,'Fr':223.0197,'Ra':226.0245,'Ac':227.0277,'Th':232.0377,'Pa':231.03588,'U':238.02891,'Np':237.0482,'Pu':239.0642,'Am':243.0614,'Cm':247.0704,'Bk':247.0703,'Cf':251.0796,'Es':252.0830,'Fm':257.0591,'Md':258.0984,'No':259.1010,'Lr':262.1097,'Rf':267.1218,'Db':268.1257,'Sg':269.1286,'Bh':274.1436,'Hs':277.1519,'Mt':278,'Ds':281,'Rg':282,'Cn':285,'Nh':284,'Fi':289,'Fl':288,'Lv':292,'Ts':294,'Og':295}

import tkinter as tk

# 注：一次只能转换一个原子

window_main = tk.Tk()
window_main.title('相对原子质量转换')
window_main.geometry('170x70')
def positive():
    window_positive = tk.Tk()
    window_positive.title('正向转换')
    window_positive.geometry('480x700')

    def run():
        a = e.get()
        b = atom[a]
        print(a,'的相对原子质量是',b)
        l = tk.Label(window_positive, text=(a,'的相对原子质量是',b), width=50, height=1)
        l.pack()
    
    e = tk.Entry(window_positive, show=None, bg='grey', width=50)
    e.pack()
    frequency = tk.Button(window_positive, text='开始转换', command=run)
    frequency.pack()

frequency = tk.Button(window_main, text='正向转换', command=positive)
frequency.pack()

window_main.mainloop()
